= このマニュアルのFAQ

* Manualの一括ダウンロードをしたいのですがどうすれば良いですか？
  * [[unknown:マニュアルダウンロード]]を参照してください

* メソッド名を元にクラスのページを探したいのですが
  * [[unknown:メソッド索引|method]]または各ページの上にある検索をお使いください。
    [[c:ReFe]]もお役に立つことでしょう。

* 間違いを見付けたのですがどこに報告すれば良いですか？
  * なおしてください。[[unknown:執筆者募集]]

* リンクのうしろにある(4d)とか(1h)とか(15m)はなんですか？
  * それぞれ4日前、1時間前、15分前に更新されたページであることを示しています。

* RD ってなんですか？
  * [[c:RD]]を参照してください

* Rubyってなんですか？
  * [[unknown:Ruby Home Page|URL:http://www.ruby-lang.org/ja/]]を参照してください

* もっと初心者向けの簡単なマニュアルが読みたいのですが
  * [[unknown:チュートリアル|URL:http://www.ruby-lang.org/ja/20020310.html]]
    や[[unknown:ユーザーズガイド|URL:http://www.ruby-lang.org/ja/uguide/uguide00.html]]
    がお望みのものかもしれません
