###nonref

= 配布条件

本ドキュメントはフリーです。以下に示す条件で本ドキュメントを
再配布できます。

なお，本ドキュメントのオリジナル(2003年08月16日現在 
((<URL:http://www.ruby-lang.org/ja/20020102.html>)) にあります)に対して加筆、
修正を行った場合、下記条件で再配布されることに同意したものと
見なされます。

 (1) 複製は制限なく自由です。フォーマットの変更も文意が変わ
     らない限り制限はありません。
     本ドキュメントの一部を引用するのも制限なく自由です。

 (2) 以下の条件のいずれかを満たす時に本ドキュメントの内容を
     変更したものを再配布できます。

     (1) 変更した本ドキュメントを自分の所属する組織内部だけで
         使う。

     (2) 変更点を明示したものを、配付物に含める。

     (3) 原文の入手法を明示する。

     (4) その他の変更条件に関して rubyist ML (rubyist@freeml.com)
         で合意を取る。
