= 1. 一般的な質問

== 1.1 Ruby/Tk とは何ですか？

Ruby/Tk は、強力なオブジェクト指向スクリプト言語である Ruby と、
手軽に GUI プログラムを作成できる Tcl/Tk を組み合わせることで、
楽しく、プログラムをすることを目指したものです。

== 1.2 どんな OS で動作するのでしょうか？


== 1.3 Tcl/Tk でなく Ruby/Tk を使うと何がうれしいのですか？

同じスクリプト言語といっても Ruby は Tcl よりかなり強力です。
Tk は使いたいけど、Tcl は使いたくない人にとって Ruby/Tk を使う意味は
大いにあるでしょう。

== 1.4 Ruby/Tk と tcltk, tcltklib ライブラリの違いは何ですか？


== 1.5 Ruby/Gtk とは何が違うのですか？

Ruby/Tk には以下のような利点があります。

* 参考に出来る Tcl/Tk, Perl/Tk などの書籍が多い
* 動作が分からないときに、確認のために C まで戻る必要がない
* Canvas の機能が充実している

Ruby/Tk には以下のような欠点があります。

* 標準で使える Widget の種類が少ない
* はやりなのは Tcl/Tk より Gtk+

== 1.6 Ruby/Qt とは何が違うのですか？

Ruby/Tk には以下のような利点があります。

* 参考に出来る Tcl/Tk, Perl/Tk などの書籍が多い
* 動作が分からないときに、確認のために C++ まで戻る必要がない
* Windows 版もただである

Ruby/Tk には以下のような欠点があります。

* 標準で使える Widget の種類が少ない
* はやりなのは Tcl/Tk より Qt
